/**
 * @file   	%<%NAME%>%.%<%EXTENSION%>%
 * @author 	%<%USER%>%
 * @version
 * @date 	%<%DATE%>%, %<%TIME%>%
 * @brief
 */


/*#### |Begin| --> Секция - "Include" ########################################*/
#include "Lib_A_PGCS_pos_gnss_correct_system.h"
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Глобальные переменные" ##########################*/
/*#### |End  | <-- Секция - "Глобальные переменные" ##########################*/


/*#### |Begin| --> Секция - "Локальные переменные" ###########################*/
/*#### |End  | <-- Секция - "Локальные переменные" ###########################*/


/*#### |Begin| --> Секция - "Прототипы локальных функций" ####################*/
/*#### |End  | <-- Секция - "Прототипы локальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание глобальных функций" ####################*/
void
PGCS_StructInit(
	pgcs_data_init_s *pInit_s)
{

}

void
PGCS_Init_All(
	pgcs_data_s *pData_s,
	pgcs_data_init_s *pInit_s)
{

}

void
PGCS_UpdatePosState(
	pgcs_data_s *pData_s)
{

}

void
PGCS_CopyVelInWorldFrame(
	pgcs_data_s *pData_s,
	__PGCS_FPT__ *pVel)
{

}

void
PGCS_CopyLatLOnAltInWorldFrame(
	pgcs_data_s *pData_s,
	__PGCS_FPT__ *pLatLonAlt)
{

}
/*#### |End  | <-- Секция - "Описание глобальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание локальных функций" #####################*/
/*#### |End  | <-- Секция - "Описание локальных функций" #####################*/


/*#### |Begin| --> Секция - "Обработчики прерываний" #########################*/
/*#### |End  | <-- Секция - "Обработчики прерываний" #########################*/

/*############################################################################*/
/*############################ END OF FILE  ##################################*/
/*############################################################################*/
